; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob80) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate8)
	(at pallet1 depot1)
	(clear crate10)
	(at pallet2 depot2)
	(clear crate6)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear crate4)
	(at pallet5 distributor2)
	(clear crate9)
	(at truck0 distributor0)
	(at truck1 depot2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot0)
	(available hoist6)
	(at crate0 depot1)
	(on crate0 pallet1)
	(at crate1 depot1)
	(on crate1 crate0)
	(at crate2 depot0)
	(on crate2 pallet0)
	(at crate3 depot1)
	(on crate3 crate1)
	(at crate4 distributor1)
	(on crate4 pallet4)
	(at crate5 depot1)
	(on crate5 crate3)
	(at crate6 depot2)
	(on crate6 pallet2)
	(at crate7 distributor2)
	(on crate7 pallet5)
	(at crate8 depot0)
	(on crate8 crate2)
	(at crate9 distributor2)
	(on crate9 crate7)
	(at crate10 depot1)
	(on crate10 crate5)
)

(:goal (and
		(on crate0 crate8)
		(on crate1 crate3)
		(on crate2 crate7)
		(on crate3 crate9)
		(on crate6 pallet0)
		(on crate7 pallet5)
		(on crate8 pallet1)
		(on crate9 pallet3)
	)
))

; plan
1. (drive truck1 depot2 depot0)
   deleted: (at truck1 depot2)
   added: (at truck1 depot0)
   goals met: 1 of 8
2. (lift hoist2 crate6 pallet2 depot2)
   deleted: (at crate6 depot2) (clear crate6) (available hoist2) (on crate6 pallet2)
   added: (lifting hoist2 crate6) (clear pallet2)
   goals met: 1 of 8
3. (lift hoist6 crate8 crate2 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist6) (on crate8 crate2)
   added: (lifting hoist6 crate8) (clear crate2)
   goals met: 1 of 8
4. (lift hoist0 crate2 pallet0 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 pallet0)
   added: (lifting hoist0 crate2) (clear pallet0)
   goals met: 1 of 8
5. (load hoist0 crate2 truck1 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck1) (available hoist0)
   goals met: 1 of 8
6. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   goals met: 1 of 8
7. (lift hoist5 crate9 crate7 distributor2)
   deleted: (at crate9 distributor2) (clear crate9) (available hoist5) (on crate9 crate7)
   added: (lifting hoist5 crate9) (clear crate7)
   goals met: 1 of 8
8. (load hoist5 crate9 truck1 distributor2)
   deleted: (lifting hoist5 crate9)
   added: (in crate9 truck1) (available hoist5)
   goals met: 1 of 8
9. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 1 of 8
10. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 1 of 8
11. (unload hoist3 crate9 truck1 distributor0)
   deleted: (in crate9 truck1) (available hoist3)
   added: (lifting hoist3 crate9)
   goals met: 1 of 8
12. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 1 of 8
13. (drop hoist3 crate9 pallet3 distributor0)
   deleted: (lifting hoist3 crate9) (clear pallet3)
   added: (available hoist3) (at crate9 distributor0) (clear crate9) (on crate9 pallet3)
   goals met: 2 of 8
14. (drive truck1 depot0 depot2)
   deleted: (at truck1 depot0)
   added: (at truck1 depot2)
   goals met: 2 of 8
15. (load hoist2 crate6 truck1 depot2)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck1) (available hoist2)
   goals met: 2 of 8
16. (drive truck1 depot2 depot0)
   deleted: (at truck1 depot2)
   added: (at truck1 depot0)
   goals met: 2 of 8
17. (unload hoist0 crate6 truck1 depot0)
   deleted: (in crate6 truck1) (available hoist0)
   added: (lifting hoist0 crate6)
   goals met: 2 of 8
18. (drop hoist0 crate6 pallet0 depot0)
   deleted: (lifting hoist0 crate6) (clear pallet0)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 pallet0)
   goals met: 3 of 8
19. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   goals met: 3 of 8
20. (unload hoist5 crate2 truck1 distributor2)
   deleted: (in crate2 truck1) (available hoist5)
   added: (lifting hoist5 crate2)
   goals met: 3 of 8
21. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 3 of 8
22. (load hoist6 crate8 truck0 depot0)
   deleted: (lifting hoist6 crate8)
   added: (in crate8 truck0) (available hoist6)
   goals met: 3 of 8
23. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   goals met: 3 of 8
24. (drop hoist5 crate2 crate7 distributor2)
   deleted: (lifting hoist5 crate2) (clear crate7)
   added: (available hoist5) (at crate2 distributor2) (clear crate2) (on crate2 crate7)
   goals met: 4 of 8
25. (lift hoist1 crate10 crate5 depot1)
   deleted: (at crate10 depot1) (clear crate10) (available hoist1) (on crate10 crate5)
   added: (lifting hoist1 crate10) (clear crate5)
   goals met: 4 of 8
26. (load hoist1 crate10 truck0 depot1)
   deleted: (lifting hoist1 crate10)
   added: (in crate10 truck0) (available hoist1)
   goals met: 4 of 8
27. (lift hoist1 crate5 crate3 depot1)
   deleted: (at crate5 depot1) (clear crate5) (available hoist1) (on crate5 crate3)
   added: (lifting hoist1 crate5) (clear crate3)
   goals met: 4 of 8
28. (load hoist1 crate5 truck0 depot1)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   goals met: 4 of 8
29. (lift hoist1 crate3 crate1 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist1) (on crate3 crate1)
   added: (lifting hoist1 crate3) (clear crate1)
   goals met: 4 of 8
30. (load hoist1 crate3 truck0 depot1)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   goals met: 4 of 8
31. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 4 of 8
32. (unload hoist3 crate3 truck0 distributor0)
   deleted: (in crate3 truck0) (available hoist3)
   added: (lifting hoist3 crate3)
   goals met: 4 of 8
33. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 4 of 8
34. (drop hoist3 crate3 crate9 distributor0)
   deleted: (lifting hoist3 crate3) (clear crate9)
   added: (available hoist3) (at crate3 distributor0) (clear crate3) (on crate3 crate9)
   goals met: 5 of 8
35. (lift hoist1 crate1 crate0 depot1)
   deleted: (at crate1 depot1) (clear crate1) (available hoist1) (on crate1 crate0)
   added: (lifting hoist1 crate1) (clear crate0)
   goals met: 5 of 8
36. (load hoist1 crate1 truck0 depot1)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   goals met: 5 of 8
37. (lift hoist1 crate0 pallet1 depot1)
   deleted: (at crate0 depot1) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   goals met: 5 of 8
38. (load hoist1 crate0 truck0 depot1)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   goals met: 5 of 8
39. (unload hoist1 crate8 truck0 depot1)
   deleted: (in crate8 truck0) (available hoist1)
   added: (lifting hoist1 crate8)
   goals met: 5 of 8
40. (drop hoist1 crate8 pallet1 depot1)
   deleted: (lifting hoist1 crate8) (clear pallet1)
   added: (available hoist1) (at crate8 depot1) (clear crate8) (on crate8 pallet1)
   goals met: 6 of 8
41. (unload hoist1 crate0 truck0 depot1)
   deleted: (in crate0 truck0) (available hoist1)
   added: (lifting hoist1 crate0)
   goals met: 6 of 8
42. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 6 of 8
43. (unload hoist3 crate1 truck0 distributor0)
   deleted: (in crate1 truck0) (available hoist3)
   added: (lifting hoist3 crate1)
   goals met: 6 of 8
44. (drop hoist3 crate1 crate3 distributor0)
   deleted: (lifting hoist3 crate1) (clear crate3)
   added: (available hoist3) (at crate1 distributor0) (clear crate1) (on crate1 crate3)
   goals met: 7 of 8
45. (drop hoist1 crate0 crate8 depot1)
   deleted: (lifting hoist1 crate0) (clear crate8)
   added: (available hoist1) (at crate0 depot1) (clear crate0) (on crate0 crate8)
   goals met: 8 of 8
